# frozen_string_literal: true

tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "asdf"
brew "aws-iam-authenticator"
brew "awscli"
brew "awscurl"
brew "bash-completion"
brew "bat"
brew "ca-certificates"
brew "curl"
brew "dnsmasq"
brew "entr"
brew "eza"
brew "fd"
brew "fish"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "glow"
brew "gnupg"
brew "gnutls"
brew "graphicsmagick"
brew "graphviz"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "ipcalc"
brew "jless"
brew "joe"
brew "jq"
brew "just"
brew "k9s"
brew "kcat"
brew "kubectx"
brew "kubernetes-cli"
brew "lazygit"
brew "make"
brew "miller"
brew "node"
brew "openjdk"
brew "pstree"
brew "psutils"
brew "qsv"
brew "rclone"
brew "ripgrep"
brew "rust"
brew "snappy"
brew "socat"
brew "switchaudio-osx"
brew "tig"
brew "uv"
brew "virtualenv"
brew "webp"
brew "yq"

cask "1password"
cask "claude-code"
cask "dash"
cask "docker-desktop" unless File.directory?("/Applications/Docker.app")
cask "font-anonymous-pro"
cask "font-hack"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "gfxcardstatus"
cask "ghostty"
cask "launchbar"
cask "moom"
cask "rq"
cask "visual-studio-code"
cask "workflowy"
