tap "adoptopenjdk/openjdk"
tap "gpanders/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "manojkarthick/pqrs"
tap "saulpw/vd"
tap "turbot/tap"
brew "act"
brew "adr-tools", link: false
brew "apache-spark"
brew "asdf"
brew "aws-iam-authenticator"
brew "aws-shell"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "brew-gem"
brew "certigo"
brew "curl"
brew "diff-so-fancy"
brew "dnsmasq"
brew "elixir"
brew "entr"
brew "erlang"
brew "eza"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "gnupg"
brew "gnutls"
brew "graphviz"
brew "htop"
brew "httpie"
brew "hub"
brew "ipcalc"
brew "jed"
brew "joe"
brew "jq"
brew "jql"
brew "k9s"
brew "kcat"
brew "krew"
brew "kubectx"
brew "kubernetes-cli"
brew "make"
brew "manojkarthick/pqrs/pqrs"
brew "most"
brew "node"
brew "octave"
brew "parquet-cli"
brew "pipenv"
brew "pipx"
brew "postgresql@14"
brew "psutils"
brew "python@3.12"
brew "rclone"
brew "ripgrep"
brew "rust"
brew "saulpw/vd/visidata"
brew "sk"
brew "snappy"
brew "socat"
brew "steampipe"
brew "subversion"
brew "tig"
brew "tmux"
brew "turbot/tap/powerpipe"
brew "virtualenv"
brew "webp"
brew "yarn"
brew "yq"
cask "1password"
cask "clocker"
cask "dash"
cask "docker"
cask "font-anonymous-pro"
cask "font-hack"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "gfxcardstatus"
cask "google-cloud-sdk"
cask "istat-menus"
cask "launchbar"
cask "licecap"
cask "meetingbar"
cask "monodraw"
cask "notion"
cask "obs"
cask "rq"
cask "session-manager-plugin"
cask "slack" unless File.directory?("/Applications/Slack.app")
cask "visual-studio-code"
cask "vlc"
cask "workflowy"
