tap "adoptopenjdk/openjdk"
tap "gpanders/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "manojkarthick/pqrs"
tap "saulpw/vd"
brew "adr-tools", link: false
brew "coreutils"
brew "asdf"
brew "snappy"
brew "xz"
brew "aws-iam-authenticator"
brew "aws-shell"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "certigo"
brew "curl"
brew "dhall"
brew "dhall-json"
brew "diff-so-fancy"
brew "dnsmasq"
brew "erlang"
brew "elixir"
brew "entr"
brew "exa"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "httpie"
brew "hub"
brew "ipcalc"
brew "jed"
brew "joe"
brew "jq"
brew "jql"
brew "k9s"
brew "kcat"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "make"
brew "most"
brew "octave"
brew "parquet-tools"
brew "pipenv"
brew "rclone"
brew "ripgrep"
brew "rust"
brew "sk"
brew "tig"
brew "tmux"
brew "yarn"
brew "gpanders/tap/ijq"
brew "manojkarthick/pqrs/pqrs"
brew "saulpw/vd/visidata"
cask "adoptopenjdk8"
cask "canon-eos-utility"
cask "dash"
cask "docker"
cask "font-anonymous-pro"
cask "font-hack"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "gfxcardstatus"
cask "google-cloud-sdk"
cask "istat-menus"
cask "keybase"
cask "launchbar"
cask "licecap"
cask "meetingbar"
cask "monodraw"
cask "notion"
cask "obs"
cask "rq"
cask "slack" unless File.directory?("/Applications/Slack.app")
cask "tuple" unless File.directory?("/Applications/Tuple.app")
cask "visual-studio-code"
cask "vlc"
cask "workflowy"
